
DROP DATABASE IF EXISTS project_01_3team;
CREATE DATABASE project_01_3team;

USE project_01_3team;
DROP TABLE IF EXISTS project_01_3team;
CREATE Table project_01_3team.charging_station (
    OBJT_ID INT PRIMARY KEY,
    CHGER_ID VARCHAR(10),
    STAT_NM VARCHAR(50) NOT NULL,
    CHGER_TY VARCHAR(2),
    USE_TM VARCHAR(50),
    ADRES VARCHAR(254),
    RN_ADRES VARCHAR(254),
    CTPRVN_CD VARCHAR(2),
    SGG_CD VARCHAR(5),
    EMD_CD VARCHAR(8),
    BUSI_NM VARCHAR(20),
    TELNO VARCHAR(20),
    X DOUBLE,
    Y DOUBLE
);

INSERT INTO charging_station (
    OBJT_ID,
    CHGER_ID,
    STAT_NM,
    CHGER_TY,
    USE_TM,
    ADRES,
    RN_ADRES,
    CTPRVN_CD,
    SGG_CD,
    EMD_CD,
    BUSI_NM,
    TELNO,
    X,
    Y
)
values('1','1','신교공영주차장','4','24시간 이용가능','서울특별시 종로구 신교동 66','서울특별시 종로구 자하문로 89 (신교동,종로구 장애인복지관 및 푸르메재활센터)','11','11110','11110102','에스트래픽','1566-1704',14134232.89,4520828.353),
('2','5','신교공영주차장','2','24시간 이용가능','서울특별시 종로구 신교동 66','서울특별시 종로구 자하문로 89 (신교동,종로구 장애인복지관 및 푸르메재활센터)','11','11110','11110102','에스트래픽','1566-1704',14134232.89,4520828.353),
('3','2','신교공영주차장','4','24시간 이용가능','서울특별시 종로구 신교동 66','서울특별시 종로구 자하문로 89 (신교동,종로구 장애인복지관 및 푸르메재활센터)','11','11110','11110102','에스트래픽','1566-1704',14134232.89,4520828.353),
('4','4','신교공영주차장','2','24시간 이용가능','서울특별시 종로구 신교동 66','서울특별시 종로구 자하문로 89 (신교동,종로구 장애인복지관 및 푸르메재활센터)','11','11110','11110102','에스트래픽','1566-1704',14134232.89,4520828.353),
('5','3','신교공영주차장','2','24시간 이용가능','서울특별시 종로구 신교동 66','서울특별시 종로구 자하문로 89 (신교동,종로구 장애인복지관 및 푸르메재활센터)','11','11110','11110102','에스트래픽','1566-1704',14134232.89,4520828.353),
('6','6','신교공영주차장','2','24시간 이용가능','서울특별시 종로구 신교동 66','서울특별시 종로구 자하문로 89 (신교동,종로구 장애인복지관 및 푸르메재활센터)','11','11110','11110102','에스트래픽','1566-1704',14134232.89,4520828.353),
('7','2','청와대 사랑채 주차장','4','24시간 이용가능','서울특별시 종로구 효자동 196-8','-','11','11110','11110104','서울에너지공사','02-2640-5199',14134601.1,4520524.177),
('8','1','청와대 사랑채 주차장','4','24시간 이용가능','서울특별시 종로구 효자동 196-8','-','11','11110','11110104','서울에너지공사','02-2640-5199',14134601.1,4520524.177),
('9','2','적선동 공영주차장','4','주중 08:00~19:00, 주말 09:00~18:00','서울특별시 종로구 적선동 150','-','11','11110','11110107','서울시','02-2640-5199',14134686.41,4519498.913),
('10','1','적선동 공영주차장','4','주중 08:00~19:00, 주말 09:00~18:00','서울특별시 종로구 적선동 150','-','11','11110','11110107','서울시','02-2640-5199',14134686.41,4519498.913),
('11','3','적선현대빌딩','2','24시간 이용가능','서울특별시 종로구 적선동 80','서울특별시 종로구 사직로 130 (적선동)','11','11110','11110107','홈앤서비스','16700-119',14134605.53,4519611.939),
('12','2','한국생산성본부','2','24시간 이용가능','서울특별시 종로구 적선동 122-1','서울특별시 종로구 새문안로5가길 32 (적선동)','11','11110','11110107','타디스테크놀로지','02-6956-3055',14134630.59,4519547.272),
('13','2','적선현대빌딩','2','24시간 이용가능','서울특별시 종로구 적선동 80','서울특별시 종로구 사직로 130 (적선동)','11','11110','11110107','홈앤서비스','16700-119',14134605.53,4519611.939),
('14','1','한국생산성본부','2','24시간 이용가능','서울특별시 종로구 적선동 122-1','서울특별시 종로구 새문안로5가길 32 (적선동)','11','11110','11110107','타디스테크놀로지','02-6956-3055',14134630.59,4519547.272),
('15','4','(주)아이비에스인더스트리(노스게이트빌딩)','2','24시간 이용가능','서울특별시 종로구 적선동 66','서울특별시 종로구 새문안로5길 55 (적선동,현대빌딩)','11','11110','11110107','파워큐브','1833-8017',14134677.32,4519578.341),
('16','1','적선현대빌딩','2','24시간 이용가능','서울특별시 종로구 적선동 80','서울특별시 종로구 사직로 130 (적선동)','11','11110','11110107','홈앤서비스','16700-119',14134605.53,4519611.939),
('17','1','(주)아이비에스인더스트리(노스게이트빌딩)','2','24시간 이용가능','서울특별시 종로구 적선동 66','서울특별시 종로구 새문안로5길 55 (적선동,현대빌딩)','11','11110','11110107','파워큐브','1833-8017',14134677.32,4519578.341),
('18','2','배화여자대학교','2','09:00~18:00','서울특별시 종로구 누상동 150-1','서울특별시 종로구 필운대로1길 34 (필운동,배화여자대학복지관)','11','11110','11110109','스타코프','02-1833-4903',14133721.56,4520176.942),
('19','2','누상공영주차장','2','24시간 이용가능','서울특별시 종로구 누상동 166-16','서울특별시 종로구 옥인6길 39 (누상동)','11','11110','11110109','서울에너지공사','02-2640-5199',14133670.73,4520318.825),
('20','1','누상공영주차장','4','24시간 이용가능','서울특별시 종로구 누상동 166-16','서울특별시 종로구 옥인6길 39 (누상동)','11','11110','11110109','서울에너지공사','02-2640-5199',14133670.73,4520318.825)
;